app/Http/Controllers/AdocoesController.php

    public function index()
    {
        $adocoes = Adocoes::orderBy('id_adocao')->paginate(10);
---
select count(*) as aggregate from `Adocoes` where `Adocoes`.`deleted_at` is null